#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [20s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_access_policy.func_profas will be created
  + resource "azurerm_key_vault_access_policy" "func_profas" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv"
      + object_id          = "c60e62e1-05cb-43d0-a958-9b75153184d2"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # azurerm_key_vault_secret.citizen_auth_common_connection_string will be created
  + resource "azurerm_key_vault_secret" "citizen_auth_common_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv"
      + name                    = "citizen-auth-common-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cosmos_api_connection_string will be created
  + resource "azurerm_key_vault_secret" "cosmos_api_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv"
      + name                    = "cosmos-api-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.iopstapp_connection_string will be created
  + resource "azurerm_key_vault_secret" "iopstapp_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv"
      + name                    = "iopstapp-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.iopstlogs_connection_string will be created
  + resource "azurerm_key_vault_secret" "iopstlogs_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv"
      + name                    = "iopstlogs-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
                "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsWebHost__hostid",
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.ExpiredSessionAdvisor.Disabled",
                # (2 unchanged elements hidden)
                "AzureWebJobs.StoreSpidLogs.Disabled",
              - "SLOT_TASK_HUBNAME",
              - "AzureFunctionsJobHost__extensions__durableTask__hubName",
              - "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
